---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.IfcExportElementAs
source: html/4efc774c-da01-2707-df68-ad012956048d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.IfcExportElementAs Property

"Export to IFC As"

## Syntax (C#)
```csharp
public static ForgeTypeId IfcExportElementAs { get; }
```